In [48]:
import pandas as pd
import numpy as np

In [49]:
# dataframe == schema(db, table)

In [50]:
# dataframe을 만드는 방법
# 1. 외부파일을 읽어온다.(csv, xlsx)
# 2. 데이터구조를 가지고 dataframe을 만들어주면 된다.
#    dic, list

In [51]:
# 항목명1    항목명2    항목명3 ==> dic(key)
#-------------------------------
# 100          200        300   ==> dic(val, list)
# 200          220        330

#{"항목명1" : [100, 200], "항목명2": [200, 220]}

In [52]:
df=pd.DataFrame({
             "name":['홍길동', '박길동'], 
             "age":[100, 30], 
             "ex":[1, 2]
            })
df

  name  age  ex
0  홍길동  100   1
1  박길동   30   2

In [90]:
df.name # df['name'] 컬럼만 추출하는 경우

0    홍길동
1    박길동
Name: name, dtype: object

In [54]:
df['age']

0    100
1     30
Name: age, dtype: int64

In [77]:
df['age'][df['age']>50] #df[컬럼명][조건]:조건이 True인 것만 추출!

0    100
Name: age, dtype: int64

In [81]:
df.loc[0] #loc[행]

name    홍길동
age     100
ex        1
Name: 0, dtype: object

In [84]:
df.loc[:,'age'] #df.loc[행, 열]

0    100
1     30
Name: age, dtype: int64

In [85]:
df.age

0    100
1     30
Name: age, dtype: int64

In [88]:
df.loc[:,'name':'age']

  name  age
0  홍길동  100
1  박길동   30

In [91]:
df.loc[0:2,'age':'ex'] #0~1행, age~ex열 추출

   age  ex
0  100   1
1   30   2

In [55]:
df['ex']

0    1
1    2
Name: ex, dtype: int64

In [92]:
df['add_column']=df['age']+df['ex']
#기본 컬럼에 새로운 컬럼 추가 가능(파생한다, 파생컬럼, 파생변수)
#df[새로 만들고 싶은 컬럼명] =df[기존 컬럼]+df[기존컬럼]
df

  name  age  ex  add_column
0  홍길동  100   1         101
1  박길동   30   2          32

In [93]:
df['next_age']=df['age']+1
df

  name  age  ex  add_column  next_age
0  홍길동  100   1         101       101
1  박길동   30   2          32        31

In [94]:
df.loc[0, 'name']

'홍길동'

In [97]:
df.iloc[0,0]

'홍길동'

In [99]:
df.loc[0,'add_column'], df.iloc[0,3], df.loc[1,'next_age'], df.iloc[1,4]

(101, 101, 31, 31)

In [100]:
df.loc[0,'add_column']=200
df.loc[1,'next_age']=300
df

  name  age  ex  add_column  next_age
0  홍길동  100   1         200       101
1  박길동   30   2          32       300

In [102]:
df.columns, df.index, df.values #중요! ->ndarray 클래스
# n : 숫자(차원 수, 1차원이면 1, 2차원 2)
# d : 차원(dimension)
# array : 리스트
# 판다스에는 여러 차원의 데이터를 하나의 클래스로 처리하기(다루기) 위해서
# 여러 차원의 데이터를 다룰 수 있는 ndarray를 만들어 놓았음.

(Index(['name', 'age', 'ex', 'add_column', 'next_age'], dtype='object'),
 RangeIndex(start=0, stop=2, step=1),
 array([['홍길동', 100, 1, 200, 101],
        ['박길동', 30, 2, 32, 300]], dtype=object))

In [56]:
df.describe() #수치항목에 대해서만! 요약
# 갯수, 평균(maen), 표준편차(std), 최소(min), 최대(max)
# 25%, 50%, 75%, 100%(사분위수)

              age        ex
count    2.000000  2.000000
mean    65.000000  1.500000
std     49.497475  0.707107
min     30.000000  1.000000
25%     47.500000  1.250000
50%     65.000000  1.500000
75%     82.500000  1.750000
max    100.000000  2.000000

In [57]:
import random

In [58]:
name_list=[]
age_list=[]
ex_list=[]
for i in range(1000):
    name_list.append('이름'+str(i))
    age_list.append(random.randint(1, 120))
    ex_list.append(random.randint(1, 2))
len(name_list), len(age_list), len(ex_list)

(1000, 1000, 1000)

In [59]:
name_list[:5] #index 0~4, 5개를 print

['이름0', '이름1', '이름2', '이름3', '이름4']

In [60]:
name_list[995:]

['이름995', '이름996', '이름997', '이름998', '이름999']

In [61]:
age_list[:5]

[75, 115, 52, 55, 55]

In [62]:
ex_list[:5]

[2, 2, 2, 2, 1]

In [63]:
df2=pd.DataFrame({
                 "name": name_list, 
                 "age": age_list, 
                 "ex": ex_list
                 }) 
# 1. df로 만들어보고,
# 2. 데이터 타입을 확인해보고,
# 3. 각 컬럼을 추출해보고,,
# 4. 숫자형 컬럼의 요약을 해보세요.

In [64]:
df2

      name  age  ex
0      이름0   75   2
1      이름1  115   2
2      이름2   52   2
3      이름3   55   2
4      이름4   55   1
..     ...  ...  ..
995  이름995   69   2
996  이름996   36   2
997  이름997   81   2
998  이름998   21   2
999  이름999   62   1

[1000 rows x 3 columns]

In [65]:
type(df2['name'])

pandas.core.series.Series

In [66]:
df2.dtypes #name: object(str), age(int64)

name    object
age      int64
ex       int64
dtype: object

In [67]:
df2['age'] #데이터프레임[컬럼명]

0       75
1      115
2       52
3       55
4       55
      ...
995     69
996     36
997     81
998     21
999     62
Name: age, Length: 1000, dtype: int64

In [68]:
df2['age'] > 50 #브로드캐스팅

0       True
1       True
2       True
3       True
4       True
       ...
995     True
996    False
997     True
998    False
999     True
Name: age, Length: 1000, dtype: bool

In [69]:
df2['age']-10 #브로드캐스팅
# 원본을 가져다가 처리하므로, df2는 바뀌지 않음.
# (비파괴 연산)

0       65
1      105
2       42
3       45
4       45
      ...
995     59
996     26
997     71
998     11
999     52
Name: age, Length: 1000, dtype: int64

In [70]:
df2['age']=df2['age']-10
df2['age']

0       65
1      105
2       42
3       45
4       45
      ...
995     59
996     26
997     71
998     11
999     52
Name: age, Length: 1000, dtype: int64

In [71]:
df2['name']=df2['name']+'님'
df2['name']

0        이름0님
1        이름1님
2        이름2님
3        이름3님
4        이름4님
        ...
995    이름995님
996    이름996님
997    이름997님
998    이름998님
999    이름999님
Name: name, Length: 1000, dtype: object

In [74]:
df2.describe()

               age           ex
count  1000.000000  1000.000000
mean     49.315000     1.516000
std      34.613955     0.499994
min      -9.000000     1.000000
25%      18.750000     1.000000
50%      47.000000     2.000000
75%      80.250000     2.000000
max     110.000000     2.000000